# specify a directory to install
cask_args appdir: '/Applications'

tap 'homebrew/cask-fonts' || true

brew 'git'
brew 'neovim'

cask 'alacritty'
cask 'authy'

# Security
cask '1password'
cask '1password-cli'

# browser
cask 'brave-browser'

# Notes
cask 'obsidian'

# Macos Tools
cask 'rectangle'
cask 'alfred'

# Python 
brew 'poetry'

# Containers
brew 'podman'
cask 'podman-desktop'

# Http Client
cask 'bruno'

# Converting videos
brew 'ffmpeg'

# Converting images
brew 'imagemagick'

# Terminal ulils
brew 'fzf'
brew 'starship'
brew 'ripgrep' # better grep
brew 'zoxide'
brew 'jq'
brew 'tree'
brew 'bat' # better cat 
brew 'tldr' # better man with examples
brew 'httpie' # http client 
brew 'eza' # better ls

brew 'zellij' # tmux alternative

# Git helpers
brew 'lazygit'
brew 'diff-so-fancy'

# fonts
cask "font-ubuntu-mono-nerd-font"

